{
  "backend/main.mo": "Motoko canister implementing authorization checks, user profile storage with avatar validation, and data models for moments, challenges, and stats.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all key frontend files and pages.",
  "frontend/index.css": "Tailwind base layer defining light/dark theme variables, global colors, and core layout styles.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router, protected routes with profile gating, and wraps all pages in layout and comfort-mode context.",
  "frontend/src/components/auth/ProfileSetupGate.tsx": "Onboarding UI collecting username, avatar, interests, and perspectives, then saving the profile and routing to the MBTI step.",
  "frontend/src/components/comfort/ComfortModeProvider.tsx": "Provides a context for comfort mode, syncing the setting with the user profile and allowing toggling.",
  "frontend/src/components/layout/ZenLayout.tsx": "Layout wrapper with a gradient background and top navigation.",
  "frontend/src/components/nav/ZenNav.tsx": "Navigation bar handling auth state, responsive menus, and dynamic links based on authentication.",
  "frontend/src/components/profile/EmojiAvatarPicker.tsx": "Emoji-based avatar selector highlighting the chosen option and enforcing required selection when needed.",
  "frontend/src/components/profile/TagMultiSelectWithOther.tsx": "Multi-select component allowing predefined or custom tags with add/remove interactions.",
  "frontend/src/constants/allowedAvatars.ts": "Defines the list of valid emoji avatars and a helper to validate them.",
  "frontend/src/constants/profileOptions.ts": "Lists predefined interests and perspectives for profile and onboarding flows.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via a React context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profile, moments, challenges, and global stats via the actor.",
  "frontend/src/index.css": "Configures Tailwind layers, defines extensive light/dark theme color variables, and adds custom glass-card and button component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/src/pages/ChatPage.tsx": "Implements a chat UI with message history, comfort mode toggle, and message-sending logic using styled components.",
  "frontend/src/pages/CirclesPage.tsx": "Displays private circles and provides a dialog for creating new circles with name and topic inputs.",
  "frontend/src/pages/DailyChallengesPage.tsx": "Loads and displays daily challenges with streak tracking and completion actions, falling back to defaults when needed.",
  "frontend/src/pages/DebateRoomsPage.tsx": "Shows a list of debate rooms and a detailed room view with guidelines and hand-raising functionality.",
  "frontend/src/pages/EmotionalSafetyPage.tsx": "Presents information about AI-guided emotional safety features including reflection, toxicity prevention, and distress support.",
  "frontend/src/pages/GlobalChartPage.tsx": "Fetches and displays global community stats with map visuals and metric cards.",
  "frontend/src/pages/HomePage.tsx": "Shows user profile and navigation tiles linking to key app sections.",
  "frontend/src/pages/LandingPage.tsx": "Provides a hero section with app vision and login/start flow for new or returning users.",
  "frontend/src/pages/MatchingPage.tsx": "Displays mock match data with compatibility metrics and selectable connection modes.",
  "frontend/src/pages/MbtiQuizPage.tsx": "Runs an MBTI quiz, computes results, and saves the user’s personality type.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile editing form that loads existing data, updates fields like name, avatar, and interests, and saves changes via API mutations.",
  "frontend/src/pages/WeeklyHighlightsPage.tsx": "Fetches top weekly moments and displays them grouped by category with loading states and styled cards.",
  "frontend/src/pages/WeeklyMomentsPage.tsx": "Allows users to submit weekly moments, select categories, increment impact counts, and view existing moments.",
  "frontend/src/utils/strings.ts": "Provides helper functions for normalizing strings and performing case-insensitive array checks.",
  "frontend/src/utils/urlParams.ts": "Utility methods for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and enabled plugins.",
  "project_state.json": "Project metadata describing onboarding flow requirements, known issues, and feature request tracking."
}