{
  "backend/main.mo": "Main backend actor defining user profiles, moments, challenges, chat data structures, and initial sample connections with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files for reference.",
  "frontend/index.css": "Base Tailwind CSS variables and theme definitions for light/dark modes and global styling.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "App router setup with protected routes, layout wrapper, and page registrations.",
  "frontend/src/components/auth/ProfileSetupGate.tsx": "Onboarding component collecting initial profile data and saving it before redirecting to the MBTI quiz.",
  "frontend/src/components/comfort/ComfortModeProvider.tsx": "Provides a context for comfort mode, syncing its state with the user profile and offering a toggle function.",
  "frontend/src/components/feedback/TransientBanner.tsx": "Displays a temporary animated banner that auto-hides or can be dismissed manually.",
  "frontend/src/components/highlights/WeeklyHighlightSpotlight.tsx": "Shows the top weekly highlight or an empty-state message if no moments exist.",
  "frontend/src/components/layout/ZenLayout.tsx": "Wraps pages with a gradient background and includes the main navigation bar.",
  "frontend/src/components/nav/ZenNav.tsx": "Renders responsive navigation with authentication handling and dynamic links based on login state.",
  "frontend/src/components/profile/EmojiAvatarPicker.tsx": "Provides a grid of selectable emoji avatars with highlighting for the chosen one.",
  "frontend/src/components/profile/TagMultiSelectWithOther.tsx": "Offers multi-select tags with predefined options plus custom user-defined entries.",
  "frontend/src/constants/allowedAvatars.ts": "Defines allowed emoji avatars and a helper to validate them.",
  "frontend/src/constants/profileOptions.ts": "Lists predefined interests and perspectives for profile setup and editing.",
  "frontend/src/data/globalChatSeed.ts": "Contains seed messages to populate the global chat when empty.",
  "frontend/src/data/mockCircles.ts": "Provides mock circle data for frontend-only navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useOnboardingCompletionMessage.ts": "A hook that stores and retrieves an onboarding completion message in sessionStorage with setters and clearers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks interacting with backend actors to fetch and mutate user profiles, moments, challenges, and messaging data.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, custom ZenLink colors, and reusable glass-card and button classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface that loads a conversation with a selected partner, displays messages, and allows sending new messages.",
  "frontend/src/pages/CircleDetailPage.tsx": "Displays details for a selected circle using mock data, including description, member count, and navigation back to the circles list.",
  "frontend/src/pages/CirclesPage.tsx": "Displays private circles, allows creating a new circle with a name and topic, and navigates to individual circle pages.",
  "frontend/src/pages/DailyChallengesPage.tsx": "Shows daily emotional growth challenges, tracks streaks, and lets users mark challenges as complete.",
  "frontend/src/pages/DebateRoomsPage.tsx": "Lists live debate rooms and provides an in-room view with guidelines and a hand-raise feature.",
  "frontend/src/pages/EmotionalSafetyPage.tsx": "Explains AI-driven emotional safety features like message reflection, toxicity prevention, and distress support.",
  "frontend/src/pages/GlobalChartPage.tsx": "Displays global community statistics including active users, trending MBTI types, and emotional trends.",
  "frontend/src/pages/GlobalChatPage.tsx": "Provides a global chat feed with perspective tagging, message posting, and fallback seed messages when backend is empty.",
  "frontend/src/pages/HomePage.tsx": "Renders the main home page with user profile info, motivational quotes, navigation links, and top moments.",
  "frontend/src/pages/LandingPage.tsx": "Displays the public landing page with hero content, vision overview, and login or start button.",
  "frontend/src/pages/MatchingPage.tsx": "Shows available user connections and lets users start a chat or view profile details.",
  "frontend/src/pages/MbtiQuizPage.tsx": "Implements an MBTI personality quiz, calculates a result, and saves it to the user profile.",
  "frontend/src/pages/ProfilePage.tsx": "Loads and edits the user profile including display name, avatar, preferences, and interests.",
  "frontend/src/pages/WeeklyHighlightsPage.tsx": "Displays categorized top weekly moments with loading state and styled highlight cards.",
  "frontend/src/pages/WeeklyMomentsPage.tsx": "Renders a page to view top weekly moments and submit new ones, including a dialog form and impact button. Uses query hooks for loading, submitting, and incrementing impact.",
  "frontend/src/utils/strings.ts": "Provides helpers to normalize strings and check array membership case- and trim-insensitively.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing/retrieving them in sessionStorage, and handling hash-based routing. Supports persisted parameters and safe clearing of stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, keyframes, and container settings with custom theme tokens and plugins.",
  "project_state.json": "Defines current project state, known issues, and required features for polishing the app, including home quote, circle entry, chat fix, and seeded global chat."
}