{
  "backend/main.mo": "Main canister actor defining user profiles, moments, challenges, chat, connections, and storage with authorization and sample connection data.",
  "backend/migration.mo": "Migration module defining old/new state types and a no-op run function returning the existing state unchanged.",
  "feature_evidence.json": "Feature evidence report listing export-related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and functionality.",
  "frontend/index.css": "Root Tailwind CSS variables and theme definitions with light/dark modes and base styles.",
  "frontend/index.html": "HTML entry point mounting the React app via root div and main.tsx script.",
  "frontend/scripts/export-version11-config.ts": "Configuration for export script defining included roots, excluded patterns, and output directory.",
  "frontend/scripts/export-version11.ts": "Script that copies project files into a clean export folder and generates a README with sharing instructions.",
  "frontend/share/version11/.exportignore": "Ignore file documenting patterns excluded from the version11 export.",
  "frontend/share/version11/.gitkeep": "Empty placeholder file ensuring the directory is tracked in Git.",
  "frontend/share/version11/README.md": "Export README explaining contents and instructions for sharing the version11 snapshot.",
  "frontend/src/App.tsx": "Sets up the TanStack router, query client, layout, and protected routes for all main pages.",
  "frontend/src/components/auth/ProfileSetupGate.tsx": "Handles initial user profile creation with avatar, interests, and redirects after saving.",
  "frontend/src/components/comfort/ComfortModeProvider.tsx": "Provides a context to read and toggle comfort mode, syncing changes to the user profile.",
  "frontend/src/components/feedback/TransientBanner.tsx": "Displays a temporary dismissible banner with auto-hide and fade animations.",
  "frontend/src/components/highlights/WeeklyHighlightSpotlight.tsx": "Shows the top weekly highlight or an empty state if none exist.",
  "frontend/src/components/layout/ZenLayout.tsx": "Layout wrapper that renders navigation and page content inside a themed container.",
  "frontend/src/components/nav/ZenNav.tsx": "Renders the top navigation bar with auth controls, responsive mobile menu, and route links.",
  "frontend/src/components/profile/EmojiAvatarPicker.tsx": "Lets users select an emoji avatar from a predefined set with visual selection states.",
  "frontend/src/components/profile/TagMultiSelectWithOther.tsx": "Multi-select component for predefined tags with support for adding custom values.",
  "frontend/src/constants/allowedAvatars.ts": "Defines allowed emoji avatars and an avatar validation helper.",
  "frontend/src/constants/profileOptions.ts": "Defines static lists of predefined interests and perspectives plus associated types.",
  "frontend/src/data/globalChatSeed.ts": "Provides seed messages for the global chat with content, metadata, and avatars.",
  "frontend/src/data/mockCircles.ts": "Contains mock circle data for local-only navigation with basic circle fields.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, and identity persistence logic.",
  "frontend/src/hooks/useOnboardingCompletionMessage.ts": "Stores and retrieves a completion message in sessionStorage for onboarding flow.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating various backend resources using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode settings, and custom UI utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Implements a chat interface supporting message sending, profile lookup, and partner selection handling.",
  "frontend/src/pages/CircleDetailPage.tsx": "Displays details for a selected circle using mock data, with sections for about, chat, and guidelines, and handles missing circles.",
  "frontend/src/pages/CirclesPage.tsx": "Lists available circles from mock data and provides a dialog to create new circles, with navigation to individual circle pages.",
  "frontend/src/pages/DailyChallengesPage.tsx": "Shows daily challenges fetched from a query with streak tracking and allows marking challenges as complete.",
  "frontend/src/pages/DebateRoomsPage.tsx": "Displays a list of debate rooms and a room view where users can raise or lower their hand and see room details.",
  "frontend/src/pages/EmotionalSafetyPage.tsx": "Presents informational sections describing the app’s AI-supported emotional safety features and user controls.",
  "frontend/src/pages/GlobalChartPage.tsx": "Fetches and displays global stats including active users, trending MBTI types, and emotional trends with a world map visual.",
  "frontend/src/pages/GlobalChatPage.tsx": "Implements a global chat interface with message posting, perspective selection, and fallback seed messages when the backend is empty.",
  "frontend/src/pages/HomePage.tsx": "Displays the main dashboard with navigation, user profile info, motivational quotes, and featured weekly content.",
  "frontend/src/pages/LandingPage.tsx": "Provides the public landing page with a hero section, authentication entry point, and an overview of ZenLink’s vision.",
  "frontend/src/pages/MatchingPage.tsx": "Shows community members, allows connecting or starting conversations, and handles connection state and errors.",
  "frontend/src/pages/MbtiQuizPage.tsx": "Presents an MBTI quiz, tracks progress, computes personality type, and saves the result to the user profile.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page that loads the caller's profile, allows updating fields like display name, avatar, and interests, and saves changes via API mutations.",
  "frontend/src/pages/WeeklyHighlightsPage.tsx": "Displays top weekly moments grouped into categories with loading state and styled highlight cards.",
  "frontend/src/pages/WeeklyMomentsPage.tsx": "Shows weekly moments, allows submitting a new moment via dialog, and supports incrementing impact on existing moments.",
  "frontend/src/utils/strings.ts": "Provides string normalization and comparison helpers for case- and trim-insensitive matching.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, animations, and container settings with custom theme values.",
  "project_state.json": "Metadata describing project state, features, and export requirements for Version 11."
}