{
  "kind": "build_request",
  "title": "Create a shareable Version 11 export folder containing all project files",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new repository folder that contains a complete, shareable snapshot of the Version 11 project files (backend + frontend + project metadata) in the same directory structure as the app.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you generate a folder adding all these files"
        ]
      },
      "acceptanceCriteria": [
        "A new folder exists at a clearly named path (e.g., export/version11/ or share/version11/)",
        "The folder includes copies of all current project source/config files referenced in the repo (including backend/main.mo, backend/migration.mo, frontend/**, and project_state.json) while preserving the original relative paths",
        "The export folder does not include build artifacts or dependency folders (e.g., node_modules, dist, .dfx, .mops, .git)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Include a single README in the export folder with English instructions for how to share the exported project without formatting changes (including WhatsApp-safe copying guidance) and how to compress the folder into a ZIP on common operating systems.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It should not change when I share it through WhatsApp.",
          "Can you generate a folder adding all these files"
        ]
      },
      "acceptanceCriteria": [
        "README is present inside the export folder",
        "README text is in English and includes explicit steps for WhatsApp code-safe sharing (monospace/code block guidance)",
        "README includes basic ZIP instructions for Windows and macOS (and optionally Linux) using built-in tools"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose them instead if needed).",
    "Respect single-actor backend architecture (all Motoko logic stays in backend/main.mo; only change backend/migration.mo if state upgrades are required)."
  ],
  "nonGoals": [
    "Implementing new app features (connections, chat changes, UI changes) unrelated to exporting/sharing the existing Version 11 code",
    "Adding third-party file hosting, cloud storage, or external deployment automation"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}