{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Onboarding flow fixes: route Begin to profile setup, add MBTI known-vs-test step with auto-redirect, and enhance Home profile center + full navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Route the authenticated LandingPage \"Begin Your Journey\" action into onboarding starting at profile setup (not directly to the MBTI quiz).",
      "acceptanceCriteria": [
        "When a signed-in user clicks \"Begin Your Journey\" on the landing page, the app navigates to a route that triggers ProfileSetupGate (profile setup screen) if the user has no profile yet.",
        "A signed-in user with an existing profile is not blocked by ProfileSetupGate when using \"Begin Your Journey\" (they proceed to the appropriate next screen, e.g., Home).",
        "User-facing button text remains in English: \"Begin Your Journey\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update the authenticated \"Begin Your Journey\" Link to navigate to \"/home\" (protected) so first-time users hit ProfileSetupGate and existing-profile users land on Home. Ensure the button text remains \"Begin Your Journey\" in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Keep ProtectedRoute + ProfileSetupGate behavior aligned with the authorization component’s recommended profile gating approach (getCallerUserProfile + isFetched) to prevent flashing and ensure first-time onboarding triggers correctly. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Insert an MBTI decision step after profile setup: choose known type vs take test; only show quiz if user chooses test.",
      "acceptanceCriteria": [
        "Immediately after ProfileSetupGate successfully saves the profile, the next screen asks (in English) whether the user knows their MBTI type or wants to take the test.",
        "If the user selects \"I know my MBTI type\", the UI prompts them to select/enter their MBTI type (e.g., one of the 16 types) and proceed without showing quiz questions.",
        "If the user selects \"Take the MBTI test\", the existing quiz questions flow is shown.",
        "The MBTI quiz questions are not displayed unless the user chooses the test path."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupGate.tsx",
          "operation": "modify",
          "description": "After successful profile save, route into the MBTI step that starts with the new decision UI (keep navigation target consistent with the updated MBTI page behavior). Ensure all user-facing text remains English."
        },
        {
          "path": "frontend/src/pages/MbtiQuizPage.tsx",
          "operation": "modify",
          "description": "Add an initial MBTI decision screen (known type vs take test) and implement a known-type selection/entry flow (e.g., selection among the 16 types) that proceeds without rendering quiz questions. Only render the existing quiz questions after the user selects the test path. Use existing composed shadcn/ui components (e.g., Button, RadioGroup, Select) without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Auto-navigate to Home after completing the MBTI step (known type save, quiz save, or skip) with no extra post-step Continue screen.",
      "acceptanceCriteria": [
        "After the user completes the MBTI decision step via any path (known type saved, quiz result saved, or user skips saving), the app navigates to \"/home\" automatically.",
        "There is no additional required user click after finishing the MBTI step to reach Home (i.e., no extra post-MBTI \"Continue\" gate).",
        "If a brief confirmation state is shown (e.g., \"Profile built successfully\"), it must auto-redirect to Home without any button press."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MbtiQuizPage.tsx",
          "operation": "modify",
          "description": "Ensure every completion path (save known MBTI type, save quiz result, or continue without saving) transitions into a brief optional confirmation state that auto-redirects to \"/home\" without requiring an extra click. Keep text in English."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Center the current user’s avatar and display name prominently on the Home screen with sensible loading/empty states.",
      "acceptanceCriteria": [
        "On \"/home\", the user’s avatar and display name are visible and placed as the central, prominent element of the page layout.",
        "Home screen fetches and renders the current user profile (and shows a reasonable loading/empty state if it is not yet available).",
        "All user-facing text used for labels/headings on the Home screen is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Fetch the current user profile using existing React Query hook(s) and render a prominent centered profile section (at minimum avatar + display name). Add a loading state and a safe empty state. Follow the authorization component guidance to prefer showing the profile name (not the principal). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Expand Home navigation so users can access every main app section/route from Home (no redundant duplicate Home entry).",
      "acceptanceCriteria": [
        "Home includes navigation entries (cards/buttons/links) to all primary app routes currently present (e.g., Home, Weekly Highlights, Weekly Debates, Connections, Circles, Chat, Weekly Moments, Daily Challenges, Global Chart, Profile, and Safety if desired).",
        "Each navigation entry from Home successfully routes to its destination without errors.",
        "Home does not contain duplicate \"Home\" navigation entries that do not add value (avoid redundant navigation items)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Home navigation card/list set to include links to all primary existing routes: Weekly Highlights (/highlights), Weekly Debates (/debates), Connections (/matching), Circles (/circles), Chat (/chat), Weekly Moments (/moments), Daily Challenges (/challenges), Global Chart (/global-chart), Profile (/profile), and Safety (/safety). Avoid including a redundant \"Home\" navigation item since the user is already on Home. Ensure labels/descriptions are English and that each Link routes correctly."
        }
      ]
    }
  ]
}