{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Version 11 shareable export folder (frontend-only tooling + README)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a clearly named Version 11 export folder and provide a repeatable way to generate a full snapshot (excluding build/dependency artifacts) while preserving original relative paths.",
      "acceptanceCriteria": [
        "A new folder exists at a clearly named path (e.g., export/version11/ or share/version11/)",
        "The folder includes copies of all current project source/config files referenced in the repo (including backend/main.mo, backend/migration.mo, frontend/**, and project_state.json) while preserving the original relative paths",
        "The export folder does not include build artifacts or dependency folders (e.g., node_modules, dist, .dfx, .mops, .git)"
      ],
      "file_operations": [
        {
          "path": "frontend/share/version11/.gitkeep",
          "operation": "create",
          "description": "Create the clearly named export folder anchor at frontend/share/version11/ so it exists in-repo even before generating the snapshot."
        },
        {
          "path": "frontend/scripts/export-version11.ts",
          "operation": "create",
          "description": "Add a Node/TS script that generates/refreshes the export snapshot into frontend/share/version11/ by copying the repository files while preserving relative paths and excluding build artifacts/dependency folders (node_modules, dist, .dfx, .mops, .git and similar). Ensure the script includes copies of backend/main.mo, backend/migration.mo, frontend/**, and project_state.json."
        },
        {
          "path": "frontend/scripts/export-version11-config.ts",
          "operation": "create",
          "description": "Add a small config module used by the export script defining inclusion roots and exclusion patterns to ensure build artifacts/dependency folders are not exported."
        },
        {
          "path": "frontend/share/version11/.exportignore",
          "operation": "create",
          "description": "Add an export ignore file documenting the excluded folders/files (node_modules, dist, .dfx, .mops, .git, etc.) to keep the snapshot clean and shareable."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Include a single English README in the Version 11 export folder with WhatsApp-safe sharing instructions and ZIP compression steps for common OSes.",
      "acceptanceCriteria": [
        "README is present inside the export folder",
        "README text is in English and includes explicit steps for WhatsApp code-safe sharing (monospace/code block guidance)",
        "README includes basic ZIP instructions for Windows and macOS (and optionally Linux) using built-in tools"
      ],
      "file_operations": [
        {
          "path": "frontend/share/version11/README.md",
          "operation": "create",
          "description": "Create README.md inside frontend/share/version11/ with English instructions for sharing without formatting changes (explicit WhatsApp-safe guidance such as sending as a document/file, or wrapping in code blocks/monospace when copying text) and steps to compress the folder into a ZIP on Windows and macOS (optionally Linux) using built-in tools. Reference running the frontend/scripts/export-version11.ts script to (re)generate the snapshot before zipping."
        },
        {
          "path": "frontend/scripts/export-version11.ts",
          "operation": "modify",
          "description": "Ensure the export script also writes/updates the README.md in the export folder (or verifies it exists) so the exported snapshot always contains the required sharing and ZIP instructions."
        }
      ]
    }
  ]
}