{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T14:14:53.770Z",
  "summary": "The diff adds an export script/config and creates a placeholder export folder with a README, but it does not appear to include an actual complete snapshot of the Version 11 project files inside the export folder. Additionally, backend logic files were changed in ways not requested by the BuildRequest.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Add a new repository folder that contains a complete, shareable snapshot of the Version 11 project files (backend + frontend + project metadata) in the same directory structure as the app.",
      "reason": "The added export folder (frontend/share/version11) contains only placeholder/documentation files (.gitkeep, .exportignore, README.md) and there is no evidence that it includes copies of backend/, frontend/, and project_state.json under preserved relative paths.",
      "evidence": [
        "frontend/share/version11/.gitkeep",
        "frontend/share/version11/.exportignore",
        "frontend/share/version11/README.md",
        "frontend/scripts/export-version11-config.ts",
        "frontend/scripts/export-version11.ts"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Include a single README in the export folder with English instructions for how to share the exported project without formatting changes (including WhatsApp-safe copying guidance) and how to compress the folder into a ZIP on common operating systems.",
      "reason": "A README exists in the export folder, but the displayed README.md content is truncated and does not show the required WhatsApp-safe copying guidance or complete ZIP instructions (Linux section appears incomplete in the snippet).",
      "evidence": [
        "frontend/share/version11/README.md"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added/modified backend canister code and migration wiring (new backend/migration.mo and changes to backend/main.mo including sample connections dataset move and migration include).",
      "reason": "The BuildRequest is focused on exporting/sharing Version 11 code; it explicitly lists non-goals as implementing unrelated app changes, and does not request backend logic changes.",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo"
      ]
    },
    {
      "description": "Introduced an automated export script and config (TypeScript) to generate the snapshot folder.",
      "reason": "The BuildRequest asks for a new repository folder containing a shareable snapshot and a README; it does not request adding scripting tooling to generate it.",
      "evidence": [
        "frontend/scripts/export-version11.ts",
        "frontend/scripts/export-version11-config.ts"
      ]
    },
    {
      "description": "Added a .exportignore documentation file inside the export folder.",
      "reason": "Not requested by the BuildRequest/requirements (only asks for the exported snapshot folder and a single README).",
      "evidence": [
        "frontend/share/version11/.exportignore"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/scripts/export-version11-config.ts",
    "frontend/scripts/export-version11.ts",
    "frontend/share/version11/.exportignore",
    "frontend/share/version11/.gitkeep",
    "frontend/share/version11/README.md",
    "project_state.json"
  ]
}